{
  "_name_or_path": "microsoft/BiomedNLP-PubMedBERT-base-uncased-abstract-fulltext",
  "architectures": [
    "BertForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "ALS",
    "1": "Dementia",
    "2": "Obsessive Compulsive Disorder",
    "3": "Parkinson\u2019s Disease",
    "4": "Scoliosis"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "ALS": 0,
    "Dementia": 1,
    "Obsessive Compulsive Disorder": 2,
    "Parkinson\u2019s Disease": 3,
    "Scoliosis": 4
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "problem_type": "single_label_classification",
  "torch_dtype": "float32",
  "transformers_version": "4.46.3",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 30522
}
